_idompk.ru/modules/catalog/views/proekty-domov/block.php

$class_comparison = '';
if(in_array($rec['id'],$count_comparison)) {$class_comparison = ' active';}

$stype_pr = \app\models\StylePr::find()->where(['id'=>$rec['material']])->asArray()->one();
$filter_pr = \app\models\FilterItem::find()->where(['name'=>$stype_pr['name']])->asArray()->one();

  $pr_settings = \app\models\ProjSettings::find()->asArray()->one();
---
SELECT * FROM `Style_pr` WHERE `id`=2
SELECT * FROM `Filter_item` WHERE `name`='Шале'
SELECT * FROM `Proj_settings`