_idompk.ru/modules/catalog/views/proekty-domov/index.php

    $this->registerMetaTag(['name' =>'description', 'content' =>$pr_settings['description']]);
  }
}
  $proj_settings = \app\models\ProjSettings::find()->asArray()->one();
  $adv_settings = \app\models\AdvSettings::find()->asArray()->one();
---
SELECT * FROM `Proj_settings`
SELECT * FROM `Adv_settings`

            <div class="row new-catalog--filter">
              <div class="col-md-auto sorting-box-prjects">
                <a class="filter-item filter-item--1" style="text-decoration: none;"><i id="count_find_word" class="font-weight-bold" style="font-style: normal;">Найдено проектов: </i> <i style="font-style: normal;" id="count_find_projects"><?=$count?></i></a>
                <?php  if (\app\models\Projects::find()->where('prcie_all > 0')->count() > 0) {
---
SELECT COUNT(*) FROM `Projects` WHERE prcie_all > 0

                <div class="form-control-title">Стиль</div>
                <select dir="rtl" id="style_select" class="form-control">
                  <option dir="ltr" value="all_reset" <?=!$filter['style_pr']?'selected="selected"':''?>>Все</option>
                  <?php foreach (\app\models\StylePr::find()->orderBy(['position'=>SORT_ASC])->asArray()->all() as $rec)
---
SELECT * FROM `Style_pr` ORDER BY `position`

                <div class="form-control-title">Материал стен</div>
                <select dir="rtl" id="material_select" class="form-control">
                  <option dir="ltr" value="all_reset" <?=!$filter['material']?'selected="selected"':''?>>Все</option>
                  <?php foreach (\app\models\Materials::find()->orderBy(['position'=>SORT_ASC])->asArray()->all() as $rec)
---
SELECT * FROM `Materials` ORDER BY `position`

            <div class="filters_element filters_element--kotelna">
              <div class="form_element">
                  <?php
                  foreach (\app\models\DopPr::find()->andWhere(['category' => 'rooms'])->orderBy(['position'=>SORT_ASC])->asArray()->all() as $dop)
---
SELECT * FROM `Dop_pr` WHERE `category`='rooms' ORDER BY `position`

              <?php /* [+] Доработки декабрь 2020 */ ?>
              <div class="form_element form_element--vnesh">
                  <?php
                  foreach (\app\models\DopPr::find()->andWhere(['category' => 'outer'])->orderBy(['position'=>SORT_ASC])->asArray()->all() as $dop)
---
SELECT * FROM `Dop_pr` WHERE `category`='inner' ORDER BY `position`

                      </div>
                  <?php  } ?>
                  <?php
                  foreach (\app\models\DopInfo::find()->andWhere(['category' => 'outer'])->orderBy(['position'=>SORT_ASC])->asArray()->all() as $dopInfo)
---
SELECT * FROM `Dop_info` WHERE `category`='inner' ORDER BY `position`

                      </div>
                  <?php  } ?>
                  <?php
                  foreach (\app\models\DopInfo::find()->andWhere(['category' => 'inner'])->orderBy(['position'=>SORT_ASC])->asArray()->all() as $dopInfo)
---
SELECT * FROM `Dop_info` WHERE `category`='form' ORDER BY `position`

              <p class="idom_switcher-box__title">Форма</p>
              <div class="form_element">
                  <?php
                  foreach (\app\models\DopInfo::find()->andWhere(['category' => 'form'])->orderBy(['position'=>SORT_ASC])->asArray()->all() as $dopInfo)
---
SELECT * FROM `Dop_info` WHERE `category`='roof' ORDER BY `position`

                  <p class="idom_switcher-box__title">Крыша</p>
                  <div class="form_element">
                      <?php
                      foreach (\app\models\DopInfo::find()->andWhere(['category' => 'roof'])->orderBy(['position'=>SORT_ASC])->asArray()->all() as $dopInfo)
---
SELECT * FROM `Dop_info` WHERE `category`='other' ORDER BY `position`


<script>

  $(function() {

    function slide_change_price ( event, ui ) {
      $(this).parents('.range_inputs').find('.before').val(ui.values[0]);
      $(this).parents('.range_inputs').find('.after').val(ui.values[1]);

      $('.filters_list__button--go').removeAttr('disabled');

      $.fn.changeDeleteLink();
    };

    $(".range_price").slider({
      range: true,
      min: 0,
      max: <?=\app\models\Projects::find()->max('price_pr')?>*<?=$proj_settings['currencyIndex']?>,
      values: [ <?=$filter['st_pr_ot']?:0?>, <?=$filter['st_pr_do']?:\app\models\Projects::find()->max('price_pr')?>*<?=$proj_settings['currencyIndex']?>],
      slide: slide_change_price,
      stop: function(event, ui ) {
        var mass = {
          st_pr_ot: $( ".range_price" ).slider( "values", 0 ),
          st_pr_do: $( ".range_price" ).slider( "values", 1 )
---
SELECT MAX(price_pr) FROM `Projects`
SELECT MAX(dlina_doma) FROM `Projects`

      }
    });

    $(".range_gb_h").slider({
      range: true,
      min: 0,
      step: 0.01,
      max: <?=\app\models\Projects::find()->max('shirina_doma')?>,
      values: [ <?=$filter['gb_s_ot']?:0?>, <?=$filter['gb_s_do']?:\app\models\Projects::find()->max('shirina_doma')?>],
      slide: slide_change_price,
      stop: function(event, ui ) {
          var mass = {
              gb_s_ot: $( ".range_gb_h" ).slider( "values", 0 ),
              gb_s_do: $( ".range_gb_h" ).slider( "values", 1 ),
              gb_d_ot: $( "#gb_d .before" ).val(),
              gb_d_do: $( "#gb_d .after" ).val(),
              only_fact_razmer: 0,
              only_inverse_razmer: 0
          };
          if($('.only_fact_razmer')[0].checked)
              mass['only_fact_razmer'] = 1;

          if($('.only_inverse_razmer')[0].checked)
              mass['only_inverse_razmer'] = 1;
---
SELECT MAX(shirina_doma) FROM `Projects`

    function slide_change_build_price ( event, ui ) {
      $(this).parents('.range_inputs').find('.before').val(ui.values[0]);
      $(this).parents('.range_inputs').find('.after').val(ui.values[1]);

      $('.filters_list__button--go').removeAttr('disabled');

      $.fn.changeDeleteLink();
    };

    $(".range_build_price").slider({
      range: true,
      min: 0,
      max: <?=\app\models\Projects::find()->max('prcie_all')?>*<?=$proj_settings['currencyIndex']?>,
      values: [ <?=$filter['st_st_ot']?:0?>, <?=$filter['st_st_do']?:\app\models\Projects::find()->max('prcie_all')?>*<?=$proj_settings['currencyIndex']?>],
      slide: slide_change_build_price,
      stop: function(event, ui ) {
        var mass = {
          st_st_ot: $( ".range_build_price" ).slider( "values", 0 ),
          st_st_do: $( ".range_build_price" ).slider( "values", 1 )
        };
        get_pr(mass);
      }
    });
---
SELECT MAX(area) FROM `Projects`

      });


      if (value_2 != 0 || value_3 != <?=\app\models\Projects::find()->max('price_pr')?> || value_4 != 'all_reset' || value_5 != 'all_reset' || value_6 != 'all_reset' || check_1 != 0 || check_2 != 0 || check_2_21 != 0 || check_2_1 != 0 || check_2_2 != 0 || check_3 != 0|| check_3_31 != 0 || check_3_32 != 0 || check_3_33 != 0  || check_4_44 !=0 || value_7 != 0 || value_8 != <?=\app\models\Projects::find()->max('area')?> || value_9 != 0 || value_10 != parseFloat(<?=\app\models\Projects::find()->max('shirina_doma')?>) || value_11 != 0 || value_12 != parseFloat(<?=\app\models\Projects::find()->max('dlina_doma')?>) || check_4 != 0 || check_4_21 != 0 || urlEnd.indexOf("/best") != -1 || urlEnd.indexOf("/new") != -1 || urlEnd.indexOf("/sale") != -1) {
---
SELECT MAX(shirina_doma) FROM `Projects`