_idompk.ru/modules/catalog/views/proekty-domov/item.php

SELECT * FROM `Contacts`
---
<?php

$contacts_info = \app\models\Contacts::find()->asArray()->one();

SELECT * FROM `Proj_settings`
---
$this->registerMetaTag(['name' => 'description', 'content' => $rec['description']]);


$pr_settings = \app\models\ProjSettings::find()->asArray()->one();

SELECT * FROM `Adv_settings`
---
  $class_comparison = ' active';
}

  $adv_settings = \app\models\AdvSettings::find()->asArray()->one();

SELECT * FROM `Style_pr` WHERE `id`='13'
SELECT * FROM `Filter_item` WHERE `name`='Без стиля'
---
              <div class="col"><span class="font-weight-bold" itemprop="name">Архитектурный стиль:</span></div>
              <div class="col" itemprop="value">
                <?php
                $stype_pr = \app\models\StylePr::find()->where(['id'=>$rec['style_pr']])->asArray()->one();
                $filter_pr = \app\models\FilterItem::find()->where(['name'=>$stype_pr['name']])->asArray()->one();

SELECT * FROM `Dop_pr` ORDER BY `position`
---
                if ($text_erker) {?>
                  <span class="item"><?=$text_erker;?></span>
                <?php }
                foreach (\app\models\DopPr::find()->orderBy(['position'=>SORT_ASC])->asArray()->all() as $dop) { ?>

SELECT * FROM `Sostav_item` WHERE `id`='2'
---
            </div>
            <div class="tab-pane fade" id="include" role="tabpanel">
              <?php
              $sostav_pr = \app\models\SostavItem::find()->where(['id'=>$rec['sostav']])->asArray()->one();

SELECT `id`, `num_pr`, `images` FROM `Projects` WHERE (`townhouse_s` = '1') AND (`id` > '284') ORDER BY `id` LIMIT 1
---
          function test($substring, $array){
            foreach ($array as $item){
              if (strpos($item,$substring)!== false){
                return true;
              }
            }
            return false;
          }

        if(count($arr))
        { ?>
          <div class="idom_info-box idom_info-box__more-links">
            <div class="idom_info-box__more">
              <div class="idom_info-title">Основные категории</div>
            </div>
            <div class="idom_info-body <?=test('proekty-domov/new',$arr)?'body_cat':null?>">
              <?php foreach ($arr as $value): ?>
                <div <?=strpos($value, 'proekty-domov/new')?'class="fff"':null ?>><?php echo $value; ?></div>
              <?php endforeach; ?>
            </div>
          </div>
     <?php } ?>


        <div class="idom_info-box idom_info-box__rotator-project">
          <?php
          $prPrev = \app\models\Projects::find()->select(['id', 'num_pr', 'images'])->where(['=','townhouse_s',$rec['townhouse_s']])->orderBy(['id'=>SORT_DESC])->andWhere(['<','id',$rec['id']])->limit(1)->asArray()->all();

SELECT * FROM `Projects` WHERE ((`area` >= 80) AND (`area` <= 140)) AND (`id` != '284') LIMIT 3
---


        if ($cc == 0) {
          foreach (\app\models\Projects::find()->where(['!=', 'id', $rec['id']])->limit(3)->asArray()->all() as $pr_area) {