_idompk.ru/models/Countries.php

  public function getCities() {
      return Cities::find()->andWhere(['country_id' => $this->id])->all();
---
SELECT * FROM `cities` WHERE `country_id`=1