_idompk.ru/models/FilterItem.php

SELECT * FROM `Filter_item` WHERE `is_show_page_project`=1
---
  public static function get_by_pr($rec)
  {
    $arr_sr = ['style_pr','material','cokol','townhouse_s','is_new','is_popular','pogreb'];

    foreach (\app\models\FilterItem::find()->andWhere(['is_show_page_project' => 1])->asArray()->all() as $filter)