_idompk.ru/models/Projects.php

SELECT * FROM `Projects` WHERE `id` IN ('77', '217', '218', '246', '281', '282', '283', '1272', '1414')
---
    public function getModifications()
    {
        $links = ProjectLinks::getLinks($this->id, true);

        if (!$links)
            return null;

        return self::find()->andWhere(['id' => $links])->all();

SELECT * FROM `Projects` WHERE `is_slider`=1 ORDER BY `priority`, `id` DESC
---
    public static function getForSlider()
    {
        $sort = ['priority' => SORT_ASC, 'id' => SORT_DESC];

        return self::find()->andWhere(['is_slider' => 1])->orderBy($sort)->all();