_idompk.ru/models/SettingsContacts.php

SELECT * FROM `settings_contacts` WHERE country_id is not null or city_id is not null
---
    public static function getGeoSettings()
    {
        /**
         * @var self[] $all
         */
        $all = self::find()->andWhere('country_id is not null or city_id is not null')->all();