_idompk.ru/models/T.php

SELECT `translate` FROM `Translate` WHERE (`lang`='ru') AND (`word`='Страна')
---
    public static function t($word)
    {
      $row = self::find()->where(['lang'=>Yii::$app->language,'word'=>$word])->select('translate')->asArray()->one();