_idompk.ru/components/SefRule.php

SELECT * FROM `Site_pages` WHERE `link_url` IN ('catalog/proekty-domov/doma-s-4-spalnyami-i-2-sanuzlami?page=69', 'catalog/proekty-domov/doma-s-4-spalnyami-i-2-sanuzlami')
SELECT * FROM `Baza_znanij_articles` WHERE `link_url`='proekty-domov'
---
  public function parseRequest($manager, $request)
  {
    $pathInfo = substr($_SERVER['REQUEST_URI'],1);
    if(!$pathInfo)
      return false;

    $link_data = explode('?',$pathInfo);

    $to_search = ($link_data[0]&&$link_data[0]!=$pathInfo)?([$pathInfo,$link_data[0]]):$pathInfo;
    $row = SitePages::find()->where(['link_url' => $to_search])->asArray()->one();
    $row1 = BazaZnanijArticles::find()->where(['link_url' => explode('/',$to_search)[1]])->asArray()->one();