_idompk.ru/controllers/SiteController.php

SELECT `url` FROM `Filter_item` WHERE `is_show_page_home`=1
SELECT * FROM `Filter_item` WHERE `url`='s-garazhom'
---
    public function actionIndex()
    {
        if ($_SERVER['REQUEST_URI'] == '/site')
            return $this->redirect('/');

        $projectsSlider = Projects::getForSlider();

        $homeLinks = FilterItem::find()->select(['url'])->where(['is_show_page_home' => 1])->asArray()->all();

        foreach ($homeLinks as $hLink) {
            $filter = FilterItem::find()->where(['url' => $hLink['url']])->asArray()->one();