_idompk.ru/views/layouts/main.php

SELECT * FROM `Contacts`
SELECT COUNT(*) FROM `Projects`
SELECT COUNT(*) FROM `Projects` WHERE (`material`=1) AND (`townhouse_s`=1)
SELECT COUNT(*) FROM `Projects` WHERE (`material`=2) AND (`townhouse_s`=1)
---
use app\assets\AppAsset;
AppAsset::register($this);

$contacts_info = \app\models\Contacts::find()->asArray()->one();
$projects_count = \app\models\Projects::find()->count();
$projects_count_gz = \app\models\Projects::find()->where(['material' => 1, 'townhouse_s'=>1 ])->count();
$projects_count_kr = \app\models\Projects::find()->where(['material' => 2, 'townhouse_s'=>1 ])->count();

SELECT * FROM `Proj_settings`
SELECT * FROM `Contacts`
---
<?php


$pr_settings = \app\models\ProjSettings::find()->one();
$contact_settings = \app\models\Contacts::find()->asArray()->one();

SELECT * FROM `countries`
---
  $itemH = json_decode($_COOKIE['itemH_box'],true);

/** @var \app\models\Countries[] $countries */
$countries = \app\models\Countries::find()->all();

SELECT * FROM `cities` WHERE `country_id`=1
---
}

/** @var \app\models\Cities[] $cities */
$cities = \app\models\Cities::find()->andWhere(['country_id' => $active_country->id])->all();

SELECT * FROM `cities`
---

if(!$active_city)
    $active_city = $cities[0];
$all_cities = \app\models\Cities::find()->all();

SELECT * FROM `Site_pages` WHERE `id`=29
---
    <div class="idompk-top-nav__items">
      <div><a class="idom_small-link text-color-green" href="https://api.whatsapp.com/send?phone=79952827078" target="_blank"><i class="idom_icon-2 idom_icon-2-whatsapp d-block d-lg-none"></i><span class="d-none d-lg-inline"><b>WhatsApp</b></span></a></div>
      <div><a class="idom_header__phone-block__callback-link text-color-blue" href="#"><i class="idom_icon-2 idom_icon-2-phone-in d-block d-lg-none"></i><span class="d-none d-lg-inline"><?=\app\models\T::t('Обратный звонок')?></span></a></div>
      <?php foreach (\app\models\SitePages::find()->where(['id'=>29])->all() as $page) { ?>

SELECT * FROM `Filter_cat` ORDER BY `position`
SELECT COUNT(*) FROM `Filter_item` WHERE `cat_id`='7'
---
                  </div>
                </div>
                <div class="idom_navigation__subnavigation-content">
                  <?php foreach (\app\models\FilterCat::find()->orderBy(['position'=>SORT_ASC])->asArray()->all() as $cat) {
                    if(\app\models\FilterItem::find()->where(['cat_id'=>$cat['id']])->count()==0)

SELECT * FROM `Filter_item` WHERE `cat_id`='7'
---
                      <span class="b"><?=$cat['name']?></span>
                      <?php if($cat['id'] == 8) {?><a class="idom_link-price" href="/catalog/proekty-domov/s-cenoj-na-stroitelstvo"><span class="text-blue font-weight-bold"><?=\app\models\T::t('Все с ценой')?></span></a><?php } ?>
                      <ul>
                        <?php foreach (\app\models\FilterItem::find()->where(['cat_id'=>$cat['id']])->asArray()->all() as $item) {

SELECT * FROM `Site_pages` WHERE `id`=28
---
              </div>
            </div>
          </li>
          <?php foreach (\app\models\SitePages::find()->where(['id'=>4])->all() as $page) { ?>

SELECT * FROM `Projects` WHERE `num_pr`='id1256ge'
---
  <div class="row idom_more-list mb-5">
    <?php
    foreach (array_slice(array_reverse($itemH), 0, 3) as $pr_n) {
      foreach (\app\models\Projects::find()->where(['num_pr' => $pr_n])->asArray()->all() as $pr_area) {

SELECT * FROM `Site_pages` WHERE `id` IN (3, 5, 28, 29)
---
            <?php if ($contacts_info['c_soc_inst']) {?><a class="idom_footer__social-link" rel="nofollow" href="<?=$contacts_info['c_soc_inst']?>" target="_blank"><i class="idom_icon idom_icon-instagram"></i></a><?php } ?>
            <a class="idom_footer__social-link" rel="nofollow" href="https://www.youtube.com/channel/UCd-ey__h1obnisO0Hv9Ga8w" target="_blank"><i class="idom_icon idom_icon-youtube"></i></a>
          </div>
          <?php foreach (\app\models\SitePages::find()->where(['id'=>[3,5,28,29]])->all() as $page) { ?>

SELECT * FROM `Site_pages` WHERE `id`=30
---
      <div class="row">
        <div class="col-sm-12 col-md-3 col-lg-2"><span class="idom-copy">&copy; <?php echo date("Y"); ?> «<?=$contacts_info['c_company_name']?>»</span></div>
        <div class="col-sm-12 col-md-9 col-lg-10">
          <?php foreach (\app\models\SitePages::find()->where(['id'=>30])->all() as $page) { ?>