_idompk.ru/views/site/index.php

SELECT * FROM `Home_page`
---
<?php

  $home_st = \app\models\HomePage::find()->asArray()->one();

SELECT * FROM `Proj_settings`
SELECT MAX(area) FROM `Projects`
---
    header("Location: /",TRUE,301);
    exit();
  }
  $pr_settings = \app\models\ProjSettings::find()->asArray()->one();

  $maxSquer = \app\models\Projects::find()->max('area');

SELECT * FROM `Home_page_category` ORDER BY `id`
SELECT * FROM `Filter_item` WHERE `id`=363
---
  <div class="idompk-popular">
    <div class="idompk-popular__container container">
      <div class="idompk-popular__items row">
        <?php  foreach (\app\models\HomePageCategory::find()->orderBy(['id'=>SORT_ASC])->all() as $key=>$category) {
          $url_name = \app\models\FilterItem::find()->where(['id'=>$category->url])->asArray()->one();

SELECT * FROM `Home_page_item` WHERE `category`=1 ORDER BY `id`
SELECT * FROM `Filter_item` WHERE `id`='240'
---
                  <a href="/catalog/proekty-domov/<?=$url_name['url']?>"><?php echo $category->name; ?></a>
                </div>
                <div class="idompk-popular__meta-row row">
                  <?php  foreach (\app\models\HomePageItem::find()->where(['category' => $category['id'] ])->orderBy(['id'=>SORT_ASC])->all() as $popular) {
                    $url_name = \app\models\FilterItem::find()->where(['id'=>$popular->url])->asArray()->one();

SELECT COUNT(*) FROM `Site_pages` WHERE `parent_id`=12
---
  </div>
  <?php } ?>

  <?php if (\app\models\SitePages::find()->where(['parent_id' => 12 ])->count() > 0) {?>