_idompk.ru/modules/catalog/controllers/ProektyDomovController.php

    public function actionIndex()
    {
        \Yii::$app->params['name_filter'] = 'index';


        if ($_POST) {
            $session = new Session();
            $session->open();
            $filter = [];
            foreach ($_POST as $key => $val) {
                if ($val == "all_reset")
                    unset($filter[$key]);
                else
                    $filter[$key] = $val;
            }
        }

        $session['projects_index'] = serialize($filter);
        $projects = Projects::Get_projects();
        $pr_settings = ProjSettings::find()->one();
---
SELECT * FROM `Proj_settings`

            exit;
        }

        $filter = FilterItem::find()->where(['url' => $name])->asArray()->one();
---
SELECT * FROM `Filter_item` WHERE `url`='id242ge'

            return $this->render('tipovye-proekty');
        }

        $article = Projects::find()->where(['num_pr' => $name])->one();

        $rec = Projects::find()->where(['num_pr' => $name])->asArray()->one();
---
SELECT * FROM `Projects` WHERE `num_pr`='id242ge'